

* priv [28/40]
  SCHEDULED: <2016-10-19 周三>
  - State "TODO"       from "TODO"       [2016-10-19 周三 09:00]
  她喜欢我
  还有时间
  我能反杀
  一直想飞到西安然后坐火车去敦煌
** DONE Kristell
   CLOSED: [2017-03-05 周日 14:35] SCHEDULED: <2017-03-02 周四>
   - State "DONE"       from "TODO"       [2017-03-05 周日 14:35]
   - State "TODO"       from ""           [2017-03-02 周四 09:56]
** DONE qyh dj 在 cygwin 验证
   CLOSED: [2017-03-05 周日 14:54] SCHEDULED: <2017-03-02 周四>
   - State "DONE"       from "TODO"       [2017-03-05 周日 14:54]
   - State "TODO"       from ""           [2017-03-02 周四 14:47]
** DONE qyh dj peek
   CLOSED: [2017-03-05 周日 16:43] SCHEDULED: <2017-03-02 周四>
   - State "DONE"       from "TODO"       [2017-03-05 周日 16:43]
   - State "TODO"       from ""           [2017-03-02 周四 14:48]
** DONE [#A] 友臣
   CLOSED: [2017-03-04 周六 10:51] SCHEDULED: <2017-03-03 周五>
   - State "DONE"       from "TODO"       [2017-03-04 周六 10:51]
   - State "TODO"       from ""           [2017-03-02 周四 09:56]
** DONE 替换 +
   CLOSED: [2016-12-26 周一 20:13]
   - State "DONE"       from "TODO"       [2016-12-26 周一 20:13]
   - State "TODO"       from ""           [2016-12-21 周三 11:19]

** TODO 学习 git tag
   - State "TODO"       from "TODO"       [2016-12-26 周一 10:28]
** DONE tmux 时间格式
   CLOSED: [2016-12-01 周四 18:23] DEADLINE: <2016-12-01 周四>
   - State "DONE"       from "TODO"       [2016-12-01 周四 18:23]
   - State "TODO"       from ""           [2016-12-01 周四 12:32]
** TODO [#A] 给 explorer 打 patch
   SCHEDULED: <2016-11-30 周三>
   - State "TODO"       from "TODO"       [2017-01-24 周二 11:38] \\
     由于覆盖正在运行的 explorer.exe 比较有难度
     转成由 sys 文件加载 dll 的方式
   - State "TODO"       from ""           [2016-11-24 周四 14:29]

*** TODO mstsc silent
    - State "TODO"       from ""           [2016-12-19 周一 16:37]
*** TODO daemon.sys
    - State "TODO"       from ""           [2017-01-25 周三 18:42]
    - 参考 Xenos 里边的 kernel create_thread
*** DONE windows version of XJJ( variable redirect )
    CLOSED: [2017-01-25 周三 12:13]
    - State "DONE"       from "TODO"       [2017-01-25 周三 12:13]
    - State "TODO"       from "TODO"       [2017-01-24 周二 11:39] \\
      dll explort
    - State "TODO"       from ""           [2016-11-24 周四 14:31]
*** DONE 生成 binary-code 的方法
    CLOSED: [2017-01-09 周一 18:44]
    - State "DONE"       from "TODO"       [2017-01-09 周一 18:44] \\
      最终使用 http://www.freebuf.com/articles/system/27122.html 来修改
    - State "TODO"       from "DONE"       [2017-01-05 周四 10:33] \\
      在 vs 里边用 c 来生成
    - 32bit
      : http://www.cnblogs.com/M4ster/p/shellcode_write.html
      : https://nickharbour.wordpress.com/2010/07/01/writing-shellcode-with-a-c-compiler/
    - 64bit 有兼容 32bit 的方法，但是是用 c++ 写的
      : http://bbs.pediy.com/showthread.php?t=203140
      : http://www.freebuf.com/articles/system/27122.html
    - State "DONE"       from "TODO"       [2016-12-20 周二 21:55] \\
      32-bit 参考 windows pe 里边的方法直接用 masm 生成即可
      64-bit 使用 nasm 编译，使用 golink 链接生成即可
    - State "TODO"       from ""           [2016-11-24 周四 14:31]
*** DONE patch in local
    CLOSED: [2016-12-20 周二 21:56]
    - State "DONE"       from "TODO"       [2016-12-20 周二 21:56] \\
      使用 python 来进行 inject
    - State "TODO"       from ""           [2016-11-24 周四 14:32]
*** DONE Cross-architecture shellcode
    CLOSED: [2017-01-05 周四 17:42]
    - State "DONE"       from "TODO"       [2017-01-05 周四 17:42]
    - State "TODO"       from ""           [2017-01-05 周四 10:34]
    - google 
    - http://www.chokepoint.net/2013/09/building-multiplatform-shellcode-header.html
    - https://github.com/amaranth0203/win-exec-calc-shellcode/blob/master/HOW_TO_BUILD.txt
*** DONE VMProtected
    CLOSED: [2017-01-25 周三 12:13]
    - State "DONE"       from "TODO"       [2017-01-25 周三 12:13]
    - State "TODO"       from ""           [2017-01-24 周二 11:39]
*** TODO RELEASE
    - State "TODO"       from ""           [2016-11-24 周四 14:32]
** DONE sqlmap
   CLOSED: [2016-11-24 周四 14:32] SCHEDULED: <2016-11-29 周二>
   - State "DONE"       from "TODO"       [2016-11-24 周四 14:32]
   - State "TODO"       from ""           [2016-11-22 周二 12:25]
*** TODO post
    - State "TODO"       from ""           [2016-11-23 周三 14:41]
*** TODO cookie/session
    - State "TODO"       from ""           [2016-11-23 周三 14:41]
** TODO [#A] VICTORY LOVES PREPARATION
   DEADLINE: <2016-10-19 周三>
   - State "TODO"       from ""           [2016-10-19 周三 10:33]
** TODO 柳铁老校区，吃好多好吃的
** TODO 我没有口红
   - State "TODO"       from ""           [2016-10-23 周日 12:03]
** DONE 下载<<六弄咖啡馆>>
   CLOSED: [2016-10-30 周日 17:01]
   - State "DONE"       from "TODO"       [2016-10-30 周日 17:01]
   - State "TODO"       from "DONE"       [2016-10-19 周三 09:01]
   :PROPERTIES:
   :movie:    must download
   :END:
** TODO <<我可以咬你一口吗>>
   - State "TODO"       from ""           [2016-10-20 周四 21:10]
** TODO <<你今天真好看>>
   - State "TODO"       from ""           [2016-10-23 周日 12:04]
** TODO <<憨豆都追女仔>>
   - State "TODO"       from ""           [2016-10-23 周日 12:06]
** TODO 同步表情
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
** DONE LKM
   CLOSED: [2016-12-04 周日 12:09]
   - State "DONE"       from "TODO"       [2016-12-04 周日 12:09]
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
** DONE PYTHON 那个模块
   CLOSED: [2016-12-04 周日 13:50]
   - State "DONE"       from "TODO"       [2016-12-04 周日 13:50] \\
     叫做 pwntools
     -> pwn
     -> CTF( 西电居然有个 XDCTF, 呵呵 )
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
关键字 ddos 阿里养鸡 arm地址
** TODO irc channel 做中转
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
** TODO tor做中转
   - State "TODO"       from ""           [2016-10-26 周三 22:51]
** DONE XJJ
   CLOSED: [2016-11-04 周五 18:53]
   - State "DONE"       from "TODO"       [2016-11-04 周五 18:53]
   - State "TODO"       from ""           [2016-10-19 周三 15:19]
*** server
**** DONE C&C address release
     CLOSED: [2016-10-19 周三 15:21]
     - State "DONE"       from ""           [2016-10-19 周三 15:21]
     - curl http://my.csdn.net/echofocus | grep wassup
**** DONE C&C address bind and listen
     CLOSED: [2016-10-20 周四 13:35]
     - State "DONE"       from "TODO"       [2016-10-20 周四 13:35]
     - State "TODO"       from ""           [2016-10-19 周三 15:21]
     - C programming
**** DONE 执行 cd 之后无效 模仿一下 netcat 用 select
     CLOSED: [2016-10-20 周四 17:12]
     - State "DONE"       from "TODO"       [2016-10-20 周四 17:12]
     - State "TODO"       from ""           [2016-10-20 周四 13:35]
*** client
**** DONE read C&C address
     CLOSED: [2016-10-19 周三 23:39]
     - State "DONE"       from "TODO"       [2016-10-19 周三 23:39]
     - State "TODO"       from ""           [2016-10-19 周三 15:37]
**** DONE create channel
     CLOSED: [2016-10-20 周四 12:32]
     - State "DONE"       from "TODO"       [2016-10-20 周四 12:32]
     - State "TODO"       from ""           [2016-10-19 周三 15:37]

**** DONE 整理 create channel 的代码
     CLOSED: [2016-10-20 周四 14:07]
     - State "DONE"       from "TODO"       [2016-10-20 周四 14:07]
     - State "TODO"       from ""           [2016-10-20 周四 13:35]

*** rootkit
    - State "TODO"       from ""           [2016-10-20 周四 17:12]
**** DONE 看感染的例子
     CLOSED: [2016-10-23 周日 12:08]
     - State "DONE"       from "TODO"       [2016-10-23 周日 12:08]
     - State "TODO"       from "TODO"       [2016-10-23 周日 12:08]
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
**** DONE 例子运行起来
     CLOSED: [2016-10-23 周日 12:08]
     - State "DONE"       from "TODO"       [2016-10-23 周日 12:08]
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
**** DONE 成功用 suterusu 感染
     CLOSED: [2016-10-24 周一 12:19]
     - State "DONE"       from "TODO"       [2016-10-24 周一 12:19]
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
**** DONE 增加 suterusu 的功能 [2/2]
     CLOSED: [2016-10-21 周五 16:34]
     - State "DONE"       from "TODO"       [2016-10-21 周五 16:34]
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
     - [X] run file after hide it
     - [X] find port and pid and hide it
**** DONE 取消 hide_port hide_pid 查看稳定性
     CLOSED: [2016-11-04 周五 14:25]
     - State "DONE"       from "TODO"       [2016-11-04 周五 14:25]
     - State "TODO"       from ""           [2016-10-23 周日 12:09]
**** DONE release
     CLOSED: [2016-11-04 周五 18:53]
     - State "DONE"       from "TODO"       [2016-11-04 周五 18:53]
     - State "TODO"       from ""           [2016-10-23 周日 12:09]
***** DONE 自启动
      CLOSED: [2016-11-04 周五 15:52]
      - State "DONE"       from "TODO"       [2016-11-04 周五 15:52]
      - State "TODO"       from ""           [2016-11-01 周二 15:44]
***** DONE hide [4/4]
      CLOSED: [2016-11-04 周五 18:08]
      - State "DONE"       from "TODO"       [2016-11-04 周五 18:08]
      - State "TODO"       from ""           [2016-11-01 周二 15:44]
      - [X] client binary
      - [X] client port
      - [X] client pid
      - [X] ko binary

** TODO 加密解密算法
   - State "TODO"       from ""           [2016-10-20 周四 18:
   - 应该用勒索程序将RSA加密后的密文
     发送到私有的服务端A
     A再通过后台直接查询比特币交易平台B
     B返回的结果
     A判断为收到钱了
     在A上用私钥进行解密
     然后将明文AES密钥和IV返回给勒索程序。
   - 使用AES加密算法去加密系统中的文件
     然后使用RSA加密算法去加密AES密钥
     虽然AES是对称加密算法
     但RSA为非对称加密算法
     只有拥有RSA私钥才能解密得到AES的密钥进而对被加密的文件进行解密
     软件加密时使用的AES密钥是随机生成的
     因此在加密过后无法复现密钥
*** DONE MD5
    CLOSED: [2016-10-26 周三 20:10]
    - State "DONE"       from "TODO"       [2016-10-26 周三 20:10]
    - State "TODO"       from ""           [2016-10-26 周三 09:45]
      output -> 128bits -> 32 in hex
      input -> break into 512-bit blocks (sixteen 32-bit words)
      input -> padded -> divisible by 512
      input -> padded -> one 1 -> many 0 -> 64 bits fewer than a multiple of 512
      ^?
      input -> padded -> remaining bits filled up with 64 bits representing the length of the original message, modulo 2^64
      process -> on 32-bit A B C D
**** TODO [#C] 最后的长度 << 3 为什么
     - State "TODO"       from ""           [2016-10-28 周五 17:08]
*** DONE 使用AES加密/解密算法去加密文件
    CLOSED: [2016-10-31 周一 18:03]
    - State "DONE"       from "TODO"       [2016-10-31 周一 18:03]
    - State "TODO"       from ""           [2016-10-26 周三 22:41]
**** DONE 需要使用 SHA 生成 fixed length keys
     CLOSED: [2016-10-30 周日 17:02]
     - State "DONE"       from "TODO"       [2016-10-30 周日 17:02]
     - State "TODO"       from ""           [2016-10-28 周五 16:06]
*** TODO 使用RSA加密AES密钥
    - State "TODO"       from ""           [2016-10-26 周三 22:41]
** DONE 转换添加 mid 到看代码的列表里
   - State "DONE"       from "DONE"       [2016-10-19 周三 09:00]
** DONE RELEASE XJJ
   CLOSED: [2016-11-11 周五 21:38] DEADLINE: <2016-11-11 周五>
   - State "DONE"       from "TODO"       [2016-11-11 周五 21:38]
   - State "TODO"       from ""           [2016-11-11 周五 09:40]
** DONE 11.21 打印
   CLOSED: [2016-11-25 周五 21:52] SCHEDULED: <2016-11-21 周一>
   - State "DONE"       from "TODO"       [2016-11-25 周五 21:52]
   - State "TODO"       from ""           [2016-11-11 周五 10:40]
** DONE 买票 12.31
   CLOSED: [2016-11-25 周五 21:52] SCHEDULED: <2016-11-12 周六>
   - State "DONE"       from "TODO"       [2016-11-25 周五 21:52]
   - State "TODO"       from ""           [2016-11-11 周五 09:41]
** DONE LaTeX 
   CLOSED: [2016-11-15 周二 10:02] SCHEDULED: <2016-11-11 周五>
   - State "DONE"       from "TODO"       [2016-11-15 周二 10:02]
   - State "TODO"       from ""           [2016-11-11 周五 09:56]
** DONE 下载歌曲 [17/17]
   CLOSED: [2016-12-02 周五 11:33] DEADLINE: <2016-10-26 周三>
   - State "DONE"       from "TODO"       [2016-12-02 周五 11:33]
   - State "TODO"       from ""           [2016-10-26 周三 09:36]
   - [X] 寂寞的鸭子
     - 苏慧伦 的 鸭子?
   - [X] 忘不了
   - [X] 为你我受冷风吹
   - [X] 姐姐妹妹站起来
   - [X] 黄昏
   - [X] 你知道不知道
   - [X] 蓝色雨（温岚）
   - [X] 启程
     - 爱情白皮书 范玮琪 ?
   - [X] 相爱十年 邓超，董洁 爱的箴言
     - 邓丽君原唱
   - [X] 圣诞结
   - [X] 演员
   - [X] 后来
   - [X] 搁浅
   - [X] 吉米来吧
   - [X] 你是我心内的一首歌
   - [X] 丹顶鹤的故事
   - [X] 遇见你的时候所有星星都落到我头上
** DONE 上传 tabbar-tweak.el
   - State "DONE"       from "DONE"       [2016-10-19 周三 09:00]

** DONE qyh dj peek
   CLOSED: [2016-11-05 周六 18:28] DEADLINE: <2016-11-07 周一>
   - State "DONE"       from "TODO"       [2016-11-05 周六 18:28]
   - State "TODO"       from ""           [2016-11-05 周六 17:44]

** DONE 同步.emacs
   CLOSED: [2016-10-19 周三 10:29]
   - State "DONE"       from "TODO"       [2016-10-19 周三 10:29]
   :PROPERTIES:
   :Effort:   0:00
   :END:
** DONE qyh_repo_rollback.sh [init|reset] [5/5]
 - [X] 列举相关的仓
   $w/kernel
   $w1
   $w1sdk
   $w2
 - [X] check arguments
 - [X] check $w
 - [X] reset 到 init
 - [X] sync 到 target
** DONE 擦白版
** DONE excel
 - [X] 计算公式（快捷键）
 - [X] 最大值
 - [X] 数据 -> 变化图
** DONE expand-region以及其他插件
** DONE 注释
** DONE 移动行
** DONE 问石梦云win7的主题
 - 搜狗的“图标整理器”
** DONE mtp驱动
   
* learn_table

| student | math | pyh | mean | pi number |
|---------+------+-----+------+-----------|
| b 测试  |   13 |  09 |   11 |         5 |
| h       |   15 |  14 | 14.5 |         7 |
| a       |   17 |  13 |   15 |         9 |
#+TBLFM: $4=vmean($2..$3)
#+TBLFM: $5='(substring (number-to-string $pi) (round(string-to-number $4)) (+ 1 (round (string-to-number $4))));    
#+CONSTANTS: pi=3.1415926535897932384666666666666

| id |              r/g |              b/g |            gb/gr |   distance |
|----+------------------+------------------+------------------+------------|
|    | 540.602836879433 | 708.265957446809 | 1028.49290780142 |  1771.8880 |
|  1 |         0.560547 |         0.629883 |         1.000977 | 0.10865988 |
|  2 |         0.571289 |         0.642578 |         1.004883 | 0.10854316 |
|  7 |         0.574219 |         0.637695 |                1 | 0.11745107 |
#+TBLFM: $5=(((($2*1024/@2$2)-1)^2+(($3*1024/@2$3)-1)^2+(($4*1024/@2$4)-1)^2)^0.5)
